<a href="https://colab.research.google.com/github/tastiz/hello-world/blob/master/df_manipulating.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
from sqlalchemy import create_engine

postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'

engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

import pandas as pd

sql = 'SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary FROM people p join salaries s on p.playerid = s.playerid'

players_df = pd.read_sql_query(sql, con=engine)

#stops the query
engine.dispose()

#returns first two rows of the data set
#players_df.head(2)

#no parantheses
#players_df.shape

#returns information of each colmuns data type
#players_df.info()

#reveals the min, max, mean, and std deviation as well as count for data
#players_df.describe()

#no parantheses just like .shape function
#players_df.columns

players_df = players_df.assign(bmi = (703 * players_df.weight) / (players_df.height**2))
players_df.head()

    playerid  birthyear birthcountry  deathyear  ... teamid lgid  salary        bmi
0  barkele01       1955          USA        NaN  ...    ATL   NL  870000  26.678192
1  bedrost01       1957          USA        NaN  ...    ATL   NL  550000  24.995556
2  benedbr01       1955          USA        NaN  ...    ATL   NL  545000  23.085945
3   campri01       1953          USA     2013.0  ...    ATL   NL  633333  25.724339
4  ceronri01       1954          USA        NaN  ...    ATL   NL  625000  26.775640

[5 rows x 15 columns]

SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary 
FROM people p 
join salaries s on p.playerid = s.playerid'